       01  :pref:-insn.
           05 :pref:-insn-opcode pic x(8).
           05 :pref:-insn-x0 pic x(8).
           05 :pref:-insn-x1 pic x(8).
           05 :pref:-insn-x2 pic x(8).
           05 :pref:-insn-rrrr pic x.
               88 :pref:-insn-rrrr-set value 'S'.
               88 :pref:-insn-rrrr-clear value 'C'.
