       01  :pref:-opcode.
           05 :pref:-opcode-mode pic x(8).
               88 :pref:-opcode-mode-a value 'A'.
               88 :pref:-opcode-mode-b value 'B'.
               88 :pref:-opcode-mode-c value 'C'.
               88 :pref:-opcode-mode-d value 'D'.
               88 :pref:-opcode-mode-e value 'E'.
           05 :pref:-opcode-name pic x(12).
           05 :pref:-opcode-code pic x(12).
           05 :pref:-opcode-description pic x(160).
