       01  :pref:-symbol.
           05 :pref:-symbol-name pic x(8).
           05 :pref:-symbol-addr pic 9(8).
           05 :pref:-symbol-type pic x.
               88 :pref:-symbol-type-extern value 'E'.
               88 :pref:-symbol-type-global value 'G'.
               88 :pref:-symbol-type-local value 'L'.
